app/controllers/abilities_controller.rb

  def index
    @abilities = Ability.all
---
SELECT "abilities".* FROM "abilities"

  def create
    @ability = Ability.new(ability_params)

    respond_to do |format|
      if @ability.save
---
INSERT INTO "abilities" ("name", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Ruby"], ["rating", 3], ["created_at", "2016-04-18 19:44:48.761663"], ["updated_at", "2016-04-18 19:44:48.761663"]]

    def set_ability
      @ability = Ability.find(params[:id])
---
SELECT  "abilities".* FROM "abilities" WHERE "abilities"."id" = ? LIMIT 1  [["id", 1]]