app/controllers/educations_controller.rb

SELECT "educations".* FROM "educations"
---
  def index
    @educations = Education.all

INSERT INTO "educations" ("title", "currently", "description", "location", "degree", "start", "finish", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @education = Education.new(education_params)

    respond_to do |format|
      if @education.save

SELECT  "educations".* FROM "educations" WHERE "educations"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_education
    @education = Education.find(params[:id])