app/controllers/languages_controller.rb

  def index
    @languages = Language.all
---
SELECT "languages".* FROM "languages"

  def create
    @language = Language.new(language_params)

    respond_to do |format|
      if @language.save
---
INSERT INTO "languages" ("name", "level", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Spanish"], ["level", "Native"], ["rating", 5], ["created_at", "2016-04-24 00:48:54.102178"], ["updated_at", "2016-04-24 00:48:54.102178"]]

  def update
    respond_to do |format|
      if @language.update(language_params)
---
UPDATE "languages" SET "level" = ?, "updated_at" = ? WHERE "languages"."id" = ?  [["level", "(Advanced)"], ["updated_at", "2016-04-24 00:49:22.170449"], ["id", 2]]

  def set_language
    @language = Language.find(params[:id])
---
SELECT  "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT 1  [["id", 2]]