app/controllers/tools_controller.rb

  def index
    @tools = Tool.all
---
SELECT "tools".* FROM "tools"

  def create
    @tool = Tool.new(tool_params)

    respond_to do |format|
      if @tool.save
---
INSERT INTO "tools" ("name", "years_experience", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Visual Studio"], ["years_experience", "3"], ["rating", 4], ["created_at", "2016-04-24 00:54:23.438870"], ["updated_at", "2016-04-24 00:54:23.438870"]]

  def set_tool
    @tool = Tool.find(params[:id])
---
SELECT  "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT 1  [["id", 1]]