app/controllers/works_controller.rb

  def create
    @work = Work.new(work_params)

    respond_to do |format|
      if @work.save
---
INSERT INTO "works" ("title", "currently", "description", "location", "role", "link", "start", "finish", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @work.update(work_params)
---
UPDATE "works" SET "link" = ?, "updated_at" = ? WHERE "works"."id" = ?  [["link", "http://www2.aitbol.com/aitbol/"], ["updated_at", "2016-04-23 18:30:06.482339"], ["id", 3]]

  def destroy
    @work.destroy
---
DELETE FROM "works" WHERE "works"."id" = ?  [["id", 1]]

  def set_work
    @work = Work.find(params[:id])
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT 1  [["id", 3]]